src/songs/app/controllers/artists_controller.rb

SELECT * FROM "artists"
---
  def index
    @artists = Artist.find :all

SELECT * FROM "artists" WHERE ("artists"."id" = 1)
---
  def show
    @artist = Artist.find(params[:id])

SELECT * FROM "artists" WHERE ("artists"."id" = 1)
---
  def edit
    @artist = Artist.find(params[:id])

SELECT * FROM "artists" WHERE ("artists"."id" = 1)
UPDATE "artists" SET "name" = 'Billy Joels', "updated_at" = '2009-11-10 12:30:49' WHERE "id" = 1
---
  def update
    @artist = Artist.find(params[:id])
    result = @artist.update_attributes(params[:artist])

INSERT INTO "artists" ("name", "updated_at", "created_at") VALUES('Billy Joel', '2009-11-10 12:28:50', '2009-11-10 12:28:50')
---
  def create
    @artist = Artist.create(params[:artist])