src/songs/app/controllers/songs_controller.rb

  def index
    @songs = Song.find :all
---
SELECT * FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)

  def edit
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)

  def update
    @song = Song.find(params[:id])
    result = @song.update_attributes(params[:song])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 7)
UPDATE "songs" SET "name" = 'Baby Grands', "updated_at" = '2009-11-10 08:54:15' WHERE "id" = 7

  def create
    @song = Song.create(params[:song])
---
INSERT INTO "songs" ("name", "updated_at", "artist_id", "duration", "created_at") VALUES('Tessie', '2009-11-10 14:32:31', NULL, 256, '2009-11-10 14:32:31')

  def destroy
    song = Song.find(params[:id])
    song.destroy
---
SELECT * FROM "songs" WHERE ("songs"."id" = 5)
DELETE FROM "songs" WHERE "id" = 15